src/InformationRegisters/Лог/Лог.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лог</name>
  <resources>
    <name>КоличествоСообщений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Подписчик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Милисекунды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ТекстЛог/ТекстЛог.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекстЛог</name>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТекущаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Подписчик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Миллисекунды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/осОтладкаСервер/Module.bsl
Процедура Генерировать(ОчередьГенерации, КоличествоСообщенийГенерации) Экспорт   
	
	ОписаниеОчереди = осОчередиСообщенийСервер.ПолучитьОписаниеОчередиПоСсылке(ОчередьГенерации);
	ИмяОчереди = ОписаниеОчереди.ИмяОчереди;
		
	Соединение = осОчередиСообщенийСерверПовтИсп.ПолучитьСоединение();
	
	ОписаниеВнешнегоМетода = осОчередиСообщенийСервер.ПолучитьОписаниеВнешнегоМетода(Перечисления.осВнешниеМетодыОбменаСообщениями.ОтправитьМассивСообщений);
	ОписаниеВнешнегоМетода.Очередь = ИмяОчереди;
	
	Итератор = 0;
	РазмерПачкиОтправки = 1000;
	МассивСообщений = Новый Массив;
	
	Пока Итератор < КоличествоСообщенийГенерации Цикл
		Итератор = Итератор + 1;
		РазмерПачкиОтправки = РазмерПачкиОтправки + 1;
		МассивСообщений.Добавить(Строка(Новый УникальныйИдентификатор));
				
		Если РазмерПачкиОтправки >= 1000 Тогда
			ОписаниеВнешнегоМетода.МассивСообщений = МассивСообщений;
			Результат = осОчередиСообщенийСервер.ВыполнитьВнешнийМетод(ОписаниеВнешнегоМетода, Соединение);
			Если Результат.КодОшибки = 522 Тогда
				Возврат;
			КонецЕсли;
			МассивСообщений.Очистить();
			РазмерПачкиОтправки = 0;
		КонецЕсли;
	КонецЦикла;
	
	ОписаниеВнешнегоМетода.МассивСообщений = МассивСообщений;
	Результат = осОчередиСообщенийСервер.ВыполнитьВнешнийМетод(ОписаниеВнешнегоМетода, Соединение);
		
	Возврат;

КонецПроцедуры

Функция ТекстСообщения(КоличествоПостов)
	//Сообщение = Строка(Новый УникальныйИдентификатор);
	//Сообщение = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	Сообщение = Формат(ГСЧ.СлучайноеЧисло(0,4294967295),"ЧЦ=36; ЧН=0; ЧВН=; ЧГ=");	 
	Возврат Сообщение;
КонецФункции

Функция ВыполнитьОтправку(Очередь, МассивСообщений, Соединение, Пачка = Неопределено, УИДЗадания = Неопределено)
	РезультатВыполненияМетода = осОчередиСообщенийСервер.ОтправитьМассивСообщений(Очередь, МассивСообщений, Соединение);
	Если РезультатВыполненияМетода.КодОшибки <> Неопределено Тогда
		ЗаписьЖурналаРегистрации("ГенераторПостов", УровеньЖурналаРегистрации.Ошибка,,,РезультатВыполненияМетода.ОписаниеОшибки);
		Возврат Ложь;
	КонецЕсли; 
	
	Если Пачка <> Неопределено И УИДЗадания <> Неопределено Тогда 
		Для Каждого СтрокаДанных Из РезультатВыполненияМетода.Данные Цикл 
			РегистрыСведений.Лог.ЗаписьВЛог(УИДЗадания, Очередь, "", СтрокаДанных.Раздел, СтрокаДанных.Смещение, Перечисления.осВнешниеМетодыОбменаСообщениями.ОтправитьМассивСообщений, СтрокаДанных.КодОшибкиДанных, СтрокаДанных.ОписаниеОшибкиДанных, Пачка);	
		КонецЦикла;		
	КонецЕсли;
	
	ТаблицаОшибок = НайтиСтрокиСОшибками(РезультатВыполненияМетода.Данные);
	Если ТаблицаОшибок.Количество() = 0 Тогда 
		Возврат Истина;
	КонецЕсли;
	
	Для Каждого СтрокаСОшибкой Из ТаблицаОшибок Цикл 
		ОписаниеОшибкиШаблон = "Очередь: %1, раздел: %2, смещение: %3, ошибка: %4";
		ОписаниеОшибки = СтрШаблон(ОписаниеОшибкиШаблон, Очередь, СтрокаСОшибкой.Раздел, СтрокаСОшибкой.Смещение, СтрокаСОшибкой.ОписаниеОшибкиДанных);
		ЗаписьЖурналаРегистрации("ГенераторПостов", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки);
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции  

Функция НайтиСтрокиСОшибками(ТабЗначений)
   Построитель = Новый ПостроительЗапроса;
   Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабЗначений);

   тОтбор = Построитель.Отбор.Добавить("КодОшибкиДанных");
   тОтбор.ВидСравнения = ВидСравнения.НеРавно;
   тОтбор.Значение = 0;
   тОтбор.Использование = Истина;

   Построитель.Выполнить();
   ТабРезультат = Построитель.Результат.Выгрузить(); 
   
   Возврат ТабРезультат;
   
КонецФункции

Процедура СделатьЗаписьВЛог(Подписчик, Длительность, Количество, МоментВремени, ТекДата) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.Лог.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ВремяВыполнения = Длительность;
	МенеджерЗаписи.КоличествоСообщений = Количество;
	МенеджерЗаписи.Подписчик = Подписчик;
	МенеджерЗаписи.Милисекунды = МоментВремени;
	МенеджерЗаписи.ТекущаяДата = ТекДата;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура СделатьЗаписьВТекстовыйЛог(Подписчик, Текст) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ТекстЛог.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Подписчик = Подписчик;
	МенеджерЗаписи.Миллисекунды = ТекущаяУниверсальнаяДатаВМиллисекундах();
	МенеджерЗаписи.ТекущаяДата = ТекущаяДатаСеанса();
	МенеджерЗаписи.Текст = Текст;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
